[
    {
    "id": 1,
    "category": "Web Development",
    "title": "Website Product dengan \nReact JS dan Laravel 8",
    "urlImageSmall": "assets/images/web2_small.png",
    "urlImageBig": "assets/images/web2_big.png",
    "certificateImg": "assets/images/icon_certificate_web.png",
    "material1Title": "Pendahuluan",
    "material2Title": "Apa itu Website",
    "material3Title": "Apa itu framework",
    "material1Content": "Selamat datang teman-teman pada course Website Product dengan React JS dan Laravel 8 ini. Pada course ini, kita akan mempelajari Bagaimana cara membuat sebuah website Product dengan bantuan framework React JS dan Laravel 8. \nUntuk materi ini, tools yang akan digunakan adalah code editor Visual Studio Code dan browser. Ayo persiapkan diri teman-teman, kami tunggu dikelas ya!",
    "material2Content": "Website adalah sebuah kumpulan halaman yang berisi informasi tertentu dan dapat diakses oleh banyak orang melalui internet. Website dapat dibuka dengan menuliskan URL atau alamat website di browser. \nWebsite pertama kali dibuat oleh Tim Berners-Lee pada akhir 1980an dan baru resmi online pada tahun 1991. Tujuan awal Tim Berners-Lee membuat sebuah website adalah supaya lebih memudahkan para peneliti di tempatnya bekerja ketika akan bertukar atau melakukan perubahan informasi.",
    "material3Content": "Framework adalah kerangka kerja yang digunakan untuk mengembangkan aplikasi berbasis desktop atau aplikasi berbasis website. Dengan menggunakan framework Anda akan lebih mudah untuk membuat aplikasi atau website. Itu karena Anda hanya perlu menyusun komponen-komponen pemrograman yang sudah jadi. Dengan kata lain, Anda tidak perlu membuat berbagai fitur dari awal lagi. Framework sengaja diciptakan untuk membantu developer mengembangkan aplikasi atau website lebih cepat serta tersusun dan terstruktur. Dengan begitu, developer dan programmer tidak perlu melakukan koding program yang diulang-ulang.",
    "material1Image": "assets/images/material1_web.png",
    "material2Image": "assets/images/material2_web.png",
    "material3Image": "assets/images/material3_web2.png"
    },
    
    {
    "id": 2,
    "category": "Design",
    "title": "Fundamental Design \nWireframe",
    "urlImageSmall": "assets/images/design1_small.png",
    "urlImageBig": "assets/images/design1_big.png",
    "certificateImg": "assets/images/icon_certificate_design.png",
    "material1Title": "Pendahuluan",
    "material2Title": "Apa itu User Interface Design",
    "material3Title": "Apa itu Wireframe",
    "material1Content": "'Selamat datang teman-teman pada course Fundamental Design Wireframe. Pada course ini, kita akan mempelajari dasar-dasar mengenai design, mengenal wireframe, dan bagaimana cara melakukan design wireframe. \nUntuk materi ini, tools yang akan digunakan adalah code editor figma dan whimsical. Ayo persiapkan diri teman-teman, kami tunggu dikelas ya!",
    "material2Content": "UI adalah bagian dari UX yang berupa tampilan visual design sebuah sistem. Tampilan tersebut memungkinkan pengguna terhubung dan berinteraksi dengan suatu produk. Selain berfungsi sebagai penghubung, UI juga berfungsi untuk memperindah tampilan sehingga dapat meningkatkan kepuasan pengguna. Namun, tak hanya harus indah, UI juga harus mudah digunakan. Beberapa komponen UI diantaranya adalah komponen tombol, ikon tipografi, tema, layout, animasi yang tampil pada produk, dan visual interaktif lainnya. Semua komponen UI tersebut didesain dengan berfokus pada keindahan dan kemudahan pengguna. Jadi, pengguna dapat menikmati produk Anda. ",
    "material3Content": "Wireframe adalah sebuah kerangka untuk menata suatu item di laman website atau aplikasi. Pembuatan wireframe biasanya dilakukan sebelum pembuatan produk tersebut dilakukan. Item yang berkaitan seperti teks, gambar, layoiting, dan sebagainya. Wireframe hanya menampilkan lembaran yang terdiri dari kotak-kotak dan garis-garis untuk mengatur tata letak berbagai elemen pada website atau aplikasi. Wireframe memungkinkan seorang developer dengan mudah mengerjakan pengembangan struktur dan arah dari website atau aplikasi yang akan dibangun. Bayangkan saja jika tidak adanya konsep ini, developer mungkin akan kebingungan saat website atau aplikasi telah jadi.",
    "material1Image": "assets/images/material1_design.png",
    "material2Image": "assets/images/material2_design1.png",
    "material3Image": "assets/images/material3_design1.png"
    },
    {
    "id": 3,
    "category": "Data Science",
    "title": "Analisis Data \nCOVID-19",
    "urlImageSmall": "assets/images/data1_small.png",
    "urlImageBig": "assets/images/data1_big.png",
    "certificateImg": "assets/images/icon_certificate_data.png",
    "material1Title": "Pendahuluan",
    "material2Title": "Apa Data analysis",
    "material3Title": "Rangkaian Proses Data Analysis",
    "material1Content": "Selamat datang teman-teman pada course Analisis Data COVID-19. Pada course ini, kita akan belajar apa itu data analysis, dan bagaimana cara menganalisis data COVID-19. Selain itu, kita akan mempelajari apa itu HTML, fungsi, tujuan, dan syntaxnya. \nUntuk materi ini, tools yang akan digunakan adalah code editor Visual Studio Code dan browser. Ayo persiapkan diri teman-teman, kami tunggu dikelas ya!",
    "material2Content": "Data Analysis adalah bentuk khusus dari Data Analytics yang digunakan dalam bisnis untuk menganalisis data dan mengambil beberapa hasil dan informasi. Data Analysis terdiri dari pendefinisian data, pemeriksaan, cleaning data, dan transformasi data untuk memberikan hasil yang bermanfaat. Dan satu hal penting yang membedakannya dengan Data Analytics adalah proses analisis ini dilakukan pada hal-hal yang telah terjadi di masa lalu.",
    "material3Content": "Urutan proses yang dilakukan dalam data analysis adalah \n1. Menentukan tujuan analisis dan hipotesis awal. \n2. Data Collection. \n3. Data Preprocessing. \n4. Analisis dan Visualisasi Data. \n5. Menentukan Kesimpulan Akhir.",
    "material1Image": "assets/images/material1_data1.png",
    "material2Image": "assets/images/material2_data1.png",
    "material3Image": "assets/images/material3_data1.png"
    },
    {
    "id": 4,
    "category": "Web Development",
    "title": "Fundamental HTML5 \nCSS3",
    "urlImageSmall": "assets/images/web1_small.png",
    "urlImageBig": "assets/images/web1_big.png",
    "certificateImg": "assets/images/icon_certificate_web.png",
    "material1Title": "Pendahuluan",
    "material2Title": "Apa itu Website",
    "material3Title": "Pengertian dan Sejarah HTML",
    "material1Content": "Selamat datang teman-teman pada course Fundamental HTML ini. Pada course ini, kita akan mempelajari dasar-dasar dari pemrograman web. Selain itu, kita akan mempelajari apa itu HTML, fungsi, tujuan, dan syntaxnya. \nUntuk materi ini, tools yang akan digunakan adalah code editor Visual Studio Code dan browser. Ayo persiapkan diri teman-teman, kami tunggu dikelas ya!",
    "material2Content": "Website adalah sebuah kumpulan halaman yang berisi informasi tertentu dan dapat diakses oleh banyak orang melalui internet. Website dapat dibuka dengan menuliskan URL atau alamat website di browser. \nWebsite pertama kali dibuat oleh Tim Berners-Lee pada akhir 1980an dan baru resmi online pada tahun 1991. Tujuan awal Tim Berners-Lee membuat sebuah website adalah supaya lebih memudahkan para peneliti di tempatnya bekerja ketika akan bertukar atau melakukan perubahan informasi.",
    "material3Content": "HTML adalah singkatan dari Hypertext Markup Language, yaitu bahasa markup standar untuk membuat dan menyusun halaman dan aplikasi web. Anda bisa menggunakan bahasa markup ini untuk bagian paragraf, heading, maupun link pada suatu web page. \nHTML dibuat oleh Tim Berners-Lee, seorang ahli fisika di lembaga penelitian CERN yang berlokasi di Swiss. Versi pertamanya dirilis pada tahun 1991, dengan 18 tag. \nBerkat popularitasnya yang terus meningkat, bahasa markup ini kini dianggap sebagai standar web resmi. Spesifikasi HTML dikelola dan dikembangkan oleh World Wide Web Consortium (W3C).",
    "material1Image": "assets/images/material1_web.png",
    "material2Image": "assets/images/material2_web.png",
    "material3Image": "assets/images/material3_web1.png"
    },
    {
    "id": 5,
    "category": "Design",
    "title": "Design Aplikasi Travel \nFigma",
    "urlImageSmall": "assets/images/design2_small.png",
    "urlImageBig": "assets/images/design2_big.png",
    "certificateImg": "assets/images/icon_certificate_design.png",
    "material1Title": "Pendahuluan",
    "material2Title": "Apa itu Figma",
    "material3Title": "Fitur yang dimiliki Figma",
    "material1Content": "Selamat datang teman-teman pada course Design Aplikasi Travel Figma. Pada course ini, kita akan mempelajari bagaimana cara mendesign sebuah aplikasi travelling menggunakan Figma. \nWah seru banget pasti ya!. Untuk materi ini, tools yang akan digunakan adalah code editor Figma dan whimsical. Ayo persiapkan diri teman-teman, kami tunggu dikelas ya!",
    "material2Content": " Figma adalah salah satu aplikasi yang bisa digunakan untuk membuat desain secara bersama-sama dengan anggota tim lainnya.Namun, menurut Design Shack Figma adalah sebuah tools desain dan membuat prototype berbasis cloud untuk proyek digital. Aplikasi yang satu ini memiliki kelebihan yaitu mempermudah penggunanya untuk melakukan kolaborasi dengan semua anggota tim di mana saja dan kapan saja. Lewat situs resminya, Figma menyatakan dirinya sebagai aplikasi yang akan memudahkan kerja sama antar tim dalam proses membuat, menguji, dan mengirim desain jadi lebih mudah.",
    "material3Content": "Salah satu fitur yang paling ditonjolkan oleh Figma adalah kemudahan kolaborasi dengan sesama anggota tim seperti yang sudah disinggung di atas.  Seperti yang dijelaskan oleh Envato Tuts, kelebihan terbesar dari aplikasi yang satu ini adalah memungkinkan kolaborasi langsung dari para desainer secara real time. Jadi, dengan kata lain setiap desainer bisa langsung bekerja dan membuat perubahan pada desain yang sedang dikerjakan secara bersama-sama. Karena berbasis cloud, maka hasil pekerjaan akan secara langsung tersimpan secara online.",
    "material1Image": "assets/images/material1_design.png",
    "material2Image": "assets/images/material2_design2.png",
    "material3Image": "assets/images/material3_design2.png"
    },
    {
        "id": 6,
        "category": "Data Science",
        "title": "Fundamental Machine \nLearning",
        "urlImageSmall": "assets/images/data_2_small.png",
        "urlImageBig": "assets/images/data_2_big.png",
        "certificateImg": "assets/images/icon_certificate_data.png",
        "material1Title": "Pendahuluan",
        "material2Title": "Apa Data Machine Learning",
        "material3Title": "Proses Machine Learning",
        "material1Content": "Selamat datang teman-teman pada course Fundamental Machine Learning. Pada course ini, kita akan belajar apa itu machine learning. \nUntuk materi ini, tools yang akan digunakan adalah code editor Visual Studio Code dan browser. Ayo persiapkan diri teman-teman, kami tunggu dikelas ya!",
        "material2Content": "Teknologi machine learning (ML) adalah mesin yang dikembangkan untuk bisa belajar dengan sendirinya tanpa arahan dari penggunanya. Pembelajaran mesin dikembangkan berdasarkan disiplin ilmu lainnya seperti statistika, matematika dan data mining sehingga mesin dapat belajar dengan menganalisa data tanpa perlu di program ulang atau diperintah.",
        "material3Content": "Proses dalam machine learning terbagi kedalam tiga jenis, yaitu \n1.Supervised Learnin. \n2. Unsupervised Learning. \n3. Reinforcement Learning",
        "material1Image": "assets/images/material1_data1.png",
        "material2Image": "assets/images/material2_data2.png",
        "material3Image": "assets/images/material3_data2.png"
    }
]